In [109]:
import pandas as pd

In [110]:
import numpy as np

In [111]:
# Example 1 sort a series of integers

In [112]:
series = pd.Series([15, 20, 10, 5, 55])

In [113]:
series

0    15
1    20
2    10
3     5
4    55
dtype: int64

In [114]:
series.sort_values()

3     5
2    10
0    15
1    20
4    55
dtype: int64

In [115]:
series.sort_values(ascending=False)

4    55
1    20
0    15
2    10
3     5
dtype: int64

In [116]:
# Example 2 sort a dataframe with strings

In [117]:
bands_data = {
  "Band": ["Invent Animate", "Silent Planet", "Gojira", "Mastodon", "Architects"],
  "Average Ticket Sales": [500, 700, 4000, 4000, 4000]
}

In [118]:
df = pd.DataFrame(bands_data)

In [119]:
df

             Band  Average Ticket Sales
0  Invent Animate                   500
1   Silent Planet                   700
2          Gojira                  4000
3        Mastodon                  4000
4      Architects                  4000

In [120]:
df_sorted_bands_asc = df.sort_values(by = "Band")

In [121]:
df_sorted_bands_asc

             Band  Average Ticket Sales
4      Architects                  4000
2          Gojira                  4000
0  Invent Animate                   500
3        Mastodon                  4000
1   Silent Planet                   700

In [122]:
df_sorted_bands_desc = df.sort_values(by= "Band", ascending=False)

In [123]:
df_sorted_bands_desc

             Band  Average Ticket Sales
1   Silent Planet                   700
3        Mastodon                  4000
0  Invent Animate                   500
2          Gojira                  4000
4      Architects                  4000

In [124]:
# Example 3 sort a dataframe by multiple columns

In [125]:
df_sorted_multi = df.sort_values(by=["Average Ticket Sales", "Band"])

In [126]:
df_sorted_multi

             Band  Average Ticket Sales
0  Invent Animate                   500
1   Silent Planet                   700
4      Architects                  4000
2          Gojira                  4000
3        Mastodon                  4000

In [127]:
df_sorted_multi_2 = df.sort_values(by=["Average Ticket Sales", "Band"], ascending=[False, True])

In [128]:
df_sorted_multi_2

             Band  Average Ticket Sales
4      Architects                  4000
2          Gojira                  4000
3        Mastodon                  4000
1   Silent Planet                   700
0  Invent Animate                   500

In [129]:
# Example 4 Dealing with null values

In [130]:
bands_data2 = {
  "Band": ["Gojira", "Mastodon", "Architects", "QOTSA", "A Perfect Circle", "Invent Animate", "Silent Planet"],
  "Average Ticket Sales": [5000, 4500, 4000, np.nan, np.nan, 500, 700]
}

In [131]:
df2 = pd.DataFrame(bands_data2)

In [132]:
df2

               Band  Average Ticket Sales
0            Gojira                5000.0
1          Mastodon                4500.0
2        Architects                4000.0
3             QOTSA                   NaN
4  A Perfect Circle                   NaN
5    Invent Animate                 500.0
6     Silent Planet                 700.0

In [133]:
df_sorted_nan1 = df2.sort_values(by="Average Ticket Sales", na_position="first")

In [134]:
df_sorted_nan1

               Band  Average Ticket Sales
3             QOTSA                   NaN
4  A Perfect Circle                   NaN
5    Invent Animate                 500.0
6     Silent Planet                 700.0
2        Architects                4000.0
1          Mastodon                4500.0
0            Gojira                5000.0

In [135]:
df_sorted_nan2 = df2.sort_values(by="Average Ticket Sales", na_position="last", ascending=False)

In [136]:
df_sorted_nan2

               Band  Average Ticket Sales
0            Gojira                5000.0
1          Mastodon                4500.0
2        Architects                4000.0
6     Silent Planet                 700.0
5    Invent Animate                 500.0
3             QOTSA                   NaN
4  A Perfect Circle                   NaN

In [137]:
# Example 5 sorting index

In [138]:
df2.sort_index(ascending=False)

               Band  Average Ticket Sales
6     Silent Planet                 700.0
5    Invent Animate                 500.0
4  A Perfect Circle                   NaN
3             QOTSA                   NaN
2        Architects                4000.0
1          Mastodon                4500.0
0            Gojira                5000.0

In [139]:
# Example 5 sorting index of a dataframe with dates | inplace = True

In [140]:
gojira_sales_data = {
  "Date" : ["2025-04-10", "2025-04-15", "2025-04-20", "2025-04-25", "2025-04-30"],
  "Ticket Sales" : [4800, 5100, 4950, 5200, 5000]
}

In [141]:
df_gojira = pd.DataFrame(gojira_sales_data)

In [142]:
df_gojira.set_index("Date", inplace=True)

In [143]:
df_gojira

            Ticket Sales
Date
2025-04-10          4800
2025-04-15          5100
2025-04-20          4950
2025-04-25          5200
2025-04-30          5000

In [144]:
df_gojira.sort_index(ascending=False, inplace=True)

In [145]:
df_gojira

            Ticket Sales
Date
2025-04-30          5000
2025-04-25          5200
2025-04-20          4950
2025-04-15          5100
2025-04-10          4800

In [146]:
# Custom sorting
df_sorted_custom = df2.sort_values(by="Average Ticket Sales", key=lambda x: x.fillna(-1), ascending=False)

In [147]:
df_sorted_custom

               Band  Average Ticket Sales
0            Gojira                5000.0
1          Mastodon                4500.0
2        Architects                4000.0
6     Silent Planet                 700.0
5    Invent Animate                 500.0
4  A Perfect Circle                   NaN
3             QOTSA                   NaN

In [148]:
bands_data3 = {
  "Band": ["Gojira", "Mastodon", "Architects", "QOTSA", "A Perfect Circle", "Invent Animate", "Silent Planet", np.nan],
  "Average Ticket Sales": [5000, 4500, 4000, np.nan, np.nan, 500, 700, 3000]
}

In [149]:
df3 = pd.DataFrame(bands_data3)

In [150]:
df_sorted_custom2 = df3.sort_values(by="Band", key= lambda x: x.fillna("zzz").str.lower())

In [151]:
df_sorted_custom2

               Band  Average Ticket Sales
4  A Perfect Circle                   NaN
2        Architects                4000.0
0            Gojira                5000.0
5    Invent Animate                 500.0
1          Mastodon                4500.0
3             QOTSA                   NaN
6     Silent Planet                 700.0
7               NaN                3000.0

In [152]:
# Example 8 n largest

In [154]:
df3.nlargest(4, "Average Ticket Sales")

         Band  Average Ticket Sales
0      Gojira                5000.0
1    Mastodon                4500.0
2  Architects                4000.0
7         NaN                3000.0

In [155]:
# Example 9 n smallest

In [156]:
df3.nsmallest(4, "Average Ticket Sales")

             Band  Average Ticket Sales
5  Invent Animate                 500.0
6   Silent Planet                 700.0
7             NaN                3000.0
2      Architects                4000.0